i 77071
first 8916
saw 3157
this 75906
when 14166
it 78924
was 48186
picked 328
as 46825
a 162696
suggestion 65
from 20478
my 12483
tivo 12
system 368
like 19786
danny 309
elfman 6
and 163531
thought 3321
might 2894
be 26751
interesting 3119
on 33761
top 1507
of 145450
that 69744
i'm 4741
fan 1878
max 210
fleischer's 2
work 4226
started 957
out 16579
with 44047
the 335934
look 4095
feel 2877
his 29354
30s 75
cartoon 528
both 3401
those 4693
would 12151
hold 537
interest 1017
wrong 1801
just 17727
few 4072
minutes 2937
in 93330
had 11286
fast 729
forward 601
button 86
down 3545
ran 237
through 4940
about 17352
15 475
br 101871
afterwards 128
read 1936
some 15734
other 9074
reviews 718
here 5477
figured 187
didn't 4315
give 3372
enough 3440
chance 1063
recorded 98
again 3974
watched 2226
there's 3072
75 70
life 6224
not 30450
getting 1619
back 4842
can't 3527
believe 2492
there 15713
aren't 883
more 14218
bad 9161
personally 445
think 7284
it's 17084
because 9036
hard 2411
to 135209
get 9244
10 4238
line 1724
comment 650
minimum 82
how 8869
many 6668
ways 802
are 29412
say 5384
is 107270
waste 1454
time 12235
movie 43057
comes 2483
across 968
though 4538
made 8093
by 22421
junior 87
high 1917
kids 1827
ready 328
outrage 33
world 3600
thinking 1162
they 21120
can 11108
breasts 128
profanity 71
puke 27
jokes 956
characters 7134
flat 551
parody 236
swinging 49
alphabet 11
lame 726
essentially 257
cobbling 4
tune 139
e 564
hitting 124
obvious 1057
f 377
then 8072
having 2540
no 12443
idea 2036
where 6316
go 5055
trip 479
intestines 33
expected 702
landing 79
doesn't 4531
let 1644
alone 1049
following 564
ones 946
board 243
entire 1461
what 15330
you 29857
expect 1177
someone 2242
trying 2468
out-south 1
park 358
stone 311
parker 228
without 3256
ability 452
determine 39
isn't 3173
funny 4238
amusing 504
if 16785
you're 1932
otherwise 668
sigh 39
leave 1101
us 3771
finns 2
take 3474
stupid 1682
blow 185
proportion 25
try 1820
market 208
cool 952
lordi 27
mediocre 359
band 501
at 23461
best 6345
single 878
gimmick 60
will 9181
only 11877
so 20139
far 2879
all 23533
marketing 82
idiots 118
reason 2316
for 44121
inherent 59
minority 66
complex 424
often 1584
encountered 53
finland 15
tries 1274
export 9
something 4989
scary 979
over 5587
want 3688
apologize 34
rest 1801
plastic-faced 1
idiocy 35
sure 2673
won 482
eurovision 9
wait 715
that's 3404
case 1519
could 7748
have 27711
been 9268
long 3216
weren't 490
bickering 31
between 3367
son 1249
father 1878
very 14041
predictable 852
male 634
stars 1614
need 1801
good 14842
slap 102
face 1562
cheese 144
whine 19
two 6687
chuckles 46
headache 55
understand 1644
why 5304
mother 1370
left 2094
her 18389
hubby 26
after 7594
47 18
years 4475
don't 8437
know 6126
she 12616
lasted 99
5 1319
me 10739
turn 1318
off 5553
wishing 85
never 6441
paid 351
3 1757
99 112
watch 6922
flow 160
well 9714
painfully 238
kept 747
watching 4586
hoping 403
fly 215
faster 97
script 2986
much 9703
repetition 21
easy 779
writer 1004
fill 225
space 715
positive 514
note 675
scenery 395
pretty 3654
fall 762
being 6595
favorite 1223
season 758
car 1192
40 293
ford 245
also 9153
quite 3723
nice 1993
gets 3200
an 21516
d 455
rating 914
approaching 59
poor 1884
film 38473
but 42429
must 3062
lead 1295
actress 1213
one 25867
francine 9
forbes 38
appeared 369
acting 6426
least 3106
kind 2757
cute 573
too 7734
appears 839
database 9
besides 408
filled 503
laughable 424
gore 991
fakey 2
death 1876
scenes 5162
people 9095
stabbed 51
gush 2
2 2779
gallons 9
blood 1142
horror 3480
films 6851
recommend 1668
highly 1132
lot 3962
better 5715
sounded 175
spoof 169
spy 191
gener 1
start 1684
reminded 347
pleasantvil 1
came 1672
up 12361
short 1801
plot 6406
ridiculous 961
kgb 16
soviet 107
union 122
russia 74
school 1546
teach 137
their 11371
spies 63
act 1231
americans 334
town 1194
set 2281
training 217
bit 3030
dated 263
grab 107
yanks 13
spice 55
things 3677
seems 3617
really 11726
odd 553
next 1697
russian 299
speaks 202
accent 481
screwed 65
casting 615
job 2258
comedy 3165
dry 221
spots 143
tops 63
nothing 4265
sing 258
dance 713
end 5580
likely 419
put 2347
sleep 315
twisted 198
punch 158
pro 76
makes 4193
sick 475
keeps 642
saying 944
god 1042
devil 244
smear 9
campaign 70
done 3003
against 1469
japanese 700
war 1898
these 5413
everyone 2123
full 1635
itself 1557
4 1287
should 4960
scene 5287
dragged 136
most 8767
striking 137
semi-musical 1
1920s 36
berlin 94
marvelous 159
cinematography 981
editing 763
national 251
departments 29
story 11748
mildly 173
engaging 303
similar 846
plots 243
miller's 17
sunny 76
sally 128
working 752
girl 2641
romanced 4
rich 571
boy 1407
family 3078
disapproval 6
complications 48
final 1324
clinch 4
four 868
musical 975
numbers 364
bunched 2
beginning 1401
we 9859
stretch 143
any 7657
further 575
buoyancy 1
miller 150
sings 148
parts 1186
baby 657
reprises 18
ever 5891
blue 387
delightful 274
reminiscent 175
irene 58
dunne 37
manner 408
delivery 184
sad 988
does 5929
forte 15
remains 438
finest 278
trailing 10
second 1877
rather 2732
vastly 62
inferior 94
runner 59
tragically 27
cut 940
sinus 5
infection 9
before 4301
days 1256
hospitals 14
antibiotics 1
such 5125
tragedies 25
preventable 1
worth 2263
visiting 74
see 11318
ziegfeld's 1
star 1898
twenties 28
loved 1413
original 3357
brilliant 1189
always 3220
strangely 166
actually 4236
looked 1007
seeing 2085
re-make 38
usually 979
little 6409
re-makes 8
them 7951
somehow 757
intrigued 120
enjoying 162
begin 676
caine 180
usual 961
jude 48
law 403
managing 41
own 3340
him 8855
clever 527
modernised 3
stops 157
last 2918
seven 343
goes 2435
completely 1888
away 2749
fact 3507
ceases 19
annoying 991
fantastic 794
tension 535
built 221
unbelievably 116
grows 134
frustration 103
seemed 1363
decided 704
make 7751
caine's 24
character 6636
homosexual 89
were 10779
different 2383
bang 88
law's 9
dead 1754
roll 308
credits 660
simply 1966
performances 1818
do 9082
drag 207
pity 219
omg 22
giving 830
instead 2185
1 2081
tom 754
hanks 137
elvis-in-the-box 1
apart 621
did 6269
halfway 172
decent 1140
cast 3763
sign 270
maybe 2330
laughs 651
mention 811
stereotypes 245
pathetic 468
wasted 559
direction 1377
amateurish 215
now 4554
blame 290
probably 2835
lies 290
director 4113
joel 77
zwick 6
he 26890
brings 630
involved 1066
your 5639
enjoy 1810
train 395
wreck 116
geez 18
telling 570
lines 1534
ya 93
called 1267
return 624
sender 4
okay 712
funnier 173
than 9847
anything 2935
review 845
avoid 776
costs 233
thorough 19
90mins 3
none 1012
wiser 27
happened 1074
cameos 145
stephen 326
fry 22
3mins 1
jack 868
dee 79
30 491
secs 4
philadelphia 35
girls 1199
vaguely 85
recognisable 18
sense 2308
whether 855
got 3586
lost 1523
edit 72
jeez 21
dvd 2231
or 17947
bed 373
morris 94
minor 400
chase 421
ok 1008
opinion 957
whole 3068
found 2566
slow 1003
tediously 13
number 999
somewhat 960
felt 1522
campy 176
times 3222
which 12006
fits 212
series 3309
jeff 292
fahey 22
plays 2210
main 2259
guy 2906
installment 121
he's 2881
actor 2283
played 2571
guess 1307
fit 488
tone 485
great 9016
liked 1510
plus 628
liners 65
arnold 137
vosloo 9
returns 307
title 1486
role 3158
given 1844
has 16762
evolved 34
hoped 142
oh 1401
anyway 1116
while 5305
abysmal 98
vote 219
darkman 31
iii 130
enjoyed 1246
mike 271
myers 95
previous 630
waynes 7
saturday 218
night 2082
live 1478
expectations 402
60s 168
bond 323
fairly 586
became 697
plain 560
minute 654
exercise 131
puerile 26
unfunny 265
possible 1000
swit 2
ched 1
ten 803
day 2503
unfair 80
switched 56
find 4122
even 12592
twelve 106
year-old 74
dialogue 1531
mbarrassment 1
painful 417
heather 39
graham 78
succession 36
including 1036
fat 269
bastard 39
matters 223
worse 1458
psychedelic 46
design 335
worst 2716
seen 6654
plague 141
several 1418
friends 1776
mine 267
blindfolded 7
º 1
among 779
others 1592
slapchop 1
vince 55
offer 377
who 20546
wrote 538
edited 240
directed 1157
joey 115
buttafuoco--not 1
exactly 994
names 385
scream 261
quality 1256
uplifting 80
skits 73
supermodels 6
taking 930
dump 57
sounds 644
robs 23
sperm 12
bank 255
rhymer 2
necrophilia 10
rotting 34
corpse 123
black 1913
fetuses 4
featuring 277
scooping 1
supposed 1511
jar 41
lots 797
gay 583
skit 63
giant 371
phallus 2
superhero 114
forced 660
abortions 10
batman 418
considered 483
crude 186
sake 246
truly 1743
group 1018
8 846
year-olds 5
easily 889
same 4034
budget 1478
apparently 913
resulted 55
lawsuit 8
shot 1991
scientologists 2
frankly 256
wouldn't 1054
root 121
alleged 55
destroyed 178
reputation 191
sank 20
matter 1101
repellent 28
junk 188
finish 405
comparison 248
ebola 2
nicest 6
way 7915
bobby 129
lee 715
mad 480
tv 2524
wearing 309
diaper 11
participating 30
dumb 592
fake 463
porno 91
amazing 1318
career 984
overcome 153
explain 450
gave 1217
piece 1514
art 1186
impossible 493
rate 530
unbiased 14
explanations 37
followed 373
am 2772
fond 102
pointless 504
movies 7574
hostel 49
disgusting 221
terrible 1634
contextual 6
meanings 36
genre 1178
historical 406
drama 1357
plenty 628
tarantino 63
happier 36
kill 1220
bill 605
spill 19
screen 2281
show 6111
thing 4501
sub-category 1
trash 470
john 2169
romero 80
undead-gory-emperor-of-the-guts 1
automatically 75
rated 389
default 14
purpose 435
tell 1709
comically 24
moment 1104
meant 613
screenplay 694
everything 2296
else 1934
faith 289
urge 102
saved 275
definitely 1579
match 588
anyones 2
wanted 1350
fellini's 13
casanova 14
choice 527
heed 20
advice 257
means 759
phantasm 47
1979 71
atmospheric 148
creepy 633
flick 1215
word 882
cult 444
sequel 812
1988 71
gory 231
witty 270
action-packed 27
entertaining 1435
however 3536
creator 82
don 346
coscarelly 1
lacked 121
new 4258
ideas 594
lord 328
1994 60
certainly 1463
complete 1027
failure 243
originality 171
desperate 323
attempts 583
bring 868
tiresome 93
disappointing 420
its 8170
predecessors 40
spoilers 581
introduced 311
secret 594
behind 1255
mysterious 404
sentinel 77
spheres 6
brain-sucking 1
flying 345
silver 130
balls 85
unraveled 8
thenceforward 1
unnecessary 306
tim 304
home 1832
style 1465
kid 1099
happens 1079
shooting 472
rocky 84
tough 441
super-cool 3
nunchaku-swinging 1
chick 216
crew 554
qualities 207
reggie 11
bannister 18
pony-tailed 1
guitar 70
playing 1608
angus 12
scrimm 2
still 5600
tall 118
man 5329
talks 219
loose 268
creepiness 33
michael 1281
baldwin 74
replaced 161
james 1056
legros 3
part 3963
difference 375
disappointment 402
especially 2501
lack 1053
quickly 635
acceptable 130
time-waster 7
compared 537
fans 1409
knowing 441
hand 1118
large 543
gaps 49
information 333
missing 592
battle 603
wits 33
actors 4445
spewed 6
mouthful's 1
nonsense 259
causing 107
gnash 1
teeth 177
agony 52
droned 6
except 1125
stomach 160
sickening 54
homo 10
erotic 187
homophobic 24
physically 149
ending 2323
detective 448
costume 217
dental 33
shop 254
facial 177
hair 481
pointed 135
disguise 70
puppet 74
puppets 61
house 2078
window 253
view 921
boooring 2
bugs 151
bunny 75
titled 109
buggy 12
baby-faced 5
finster 2
robbed 43
money 2328
carriage 15
rolled 80
fell 346
into 9099
bug's 50
rabbit 84
hole 153
dressed 281
bugg's 1
retrieve 36
looking 2260
bathroom 114
mirror 161
shaving 19
cigar 20
mouth 306
straight 758
hilarious 968
5-minute 1
interested 647
buy 758
1954 32
you'll 1285
classic 1807
cartoons 205
boot 94
spoofs 41
21st 59
century 486
examples 181
mostly 933
80s 278
said 2194
franchise 148
hit 956
miss 859
elvira 126
mistress 85
dark 1360
rise 225
above 804
14th 20
fail 282
deliver 329
types 241
particularly 1060
big 3346
offender 15
transylvania 22
6-5000 3
major 923
reasons 592
pros 51
dopey 35
humor 1303
corny 255
catch 433
theme 805
song 983
transylvanian 5
locations 262
cons 59
threadbare 20
tedious 218
pacing 296
monsters 273
monster 611
viewers 784
angry 334
thoughts 219
bits 293
comedies 431
floor 276
our 2510
eyes 1210
yawn 67
aching 15
anchor 32
bay 81
released 969
tired 377
i'll 977
admit 620
anyone's 60
twist 594
despite 1363
lavish 55
production 1728
wonderful 1651
costumes 417
chore 32
murder-mystery 2
vehicle 232
mount 22
proceedings 112
staggering 28
halt 31
involving 463
although 2525
obviously 1161
spent 531
badly 646
staged 103
poorly 689
photographed 122
pre-code 50
wear 180
clothing 109
singing 511
praises 25
marijuana 42
one-note 29
carl 105
brisson 17
victor 224
mclaglen 74
police 1087
lieutenent 1
lurches 11
umpteenth 8
hunt 209
clues 123
may 3357
throw 386
towel 26
fast-forward 35
patrons 16
trapped 183
cinema 1434
release 772
anyone 2572
helps 360
anger 190
flipping 35
channels 85
come 3167
upon 839
half 1736
morbid 73
curiosity 122
pat 138
roberson 3
together 2217
listening 184
consequence 49
old 4069
thinks 437
fear 532
damnation 5
longer 476
affects 62
once 2301
thank 434
please 1041
answer 360
question 682
dodging 12
lightning 55
bolts 16
eternity 67
flaws 363
mocking 33
pretentious 267
yuppies 6
satisfying 214
fails 606
realize 652
makers 401
themselves 1181
guilty 194
deserve 287
mocked 19
characteristics 59
yuppie 23
conceited 12
misunderstanding 22
sophisticated 126
ignores 48
characteristic 44
focuses 180
misunderstandings 24
dinning 1
ironic 160
boast 24
taste 432
dinner 152
pompous 40
video 1600
library 139
bet 241
american 2041
psycho 210
cliche 80
ridden 37
romantic 839
every 3967
cringe 83
worthy 313
corey 50
soo 22
naive 217
listened 43
danny's 21
false 193
promises 84
neve 24
campbell 93
killer 1377
urban 183
legend 298
redeeming 325
attempt 1049
dean 184
paras 1
looks 2411
late 1145
thirties 54
she's 1437
college 475
australia 113
smooth 120
reasonably 119
successful 522
masti 4
tad 97
inder 2
kumar 74
returned 117
pyaare 2
mohan 8
based 1367
hollywood 1761
evil 1431
hear 734
reminds 297
hum 44
hai 18
kamaal 1
ke 9
kader 6
anupam 13
play 2179
blind 256
deaf 77
laughing 524
snehal 2
dabi's 1
head 1476
stuck 342
horse 271
type 1017
laugh 1315
mock 42
starts 1220
clichéd 179
sadly 573
moments 1658
moves 525
boring 1808
handled 204
becomes 1378
action 3182
rescue 227
heroines 24
ott 24
fight 1126
music 3015
stands 398
love 6338
angel 218
vivek 4
awful 1660
comic 836
timing 160
serious 978
doing 1591
ruined 227
fardeen 6
khan 87
wooden 326
amongst 164
esha 8
amrita 57
boman 23
irani 24
annoys 29
dabbi 1
consider 511
nightmare 317
couldn't 1492
remember 1701
20 623
tires 12
write 649
joke 601
freddy 223
joker 62
tried 770
roots 82
darker 117
basically 904
shoot 401
unfortunately 1353
forgot 176
add 806
suspense 729
scares 187
dream 620
child 1191
neither 537
nor 684
exception 401
lisa 176
wilcox 18
killing 677
lisa's 8
using 795
dreams 436
unborn 32
base 169
90 342
sometimes 1214
confusing 367
stop 978
wondering 359
filmmakers 565
aiming 55
holes 350
swiss 34
therefore 335
cheesy 627
switzerland 33
special 2079
effects 2164
example 1371
bother 396
rent 689
completeness 2
mess 638
used 1846
6 503
messy 65
worthless 126
cheap 869
sequence 866
82 18
feels 810
forever 389
die-hard 67
van 487
damme 72
myself 1147
lowell 15
written 1477
body 941
stale 87
execution 188
cherry 20
cake 97
minus 70
eva 130
longoria 52
hardly 613
appealing 221
delivers 356
likable 378
performance 2891
paul 858
rudd 36
jaded 55
lake 248
bell 107
miscast 142
manly 15
strictly 128
average 695
jason 325
biggs 14
lindsay 70
sloane 35
entertainment 859
entertained 237
expedition 79
led 327
hunky 37
captain 316
storm 152
mark 624
dana 77
travels 105
valley 81
kings 38
cairo 12
earlier 660
meet 666
beautiful 2166
simira 5
ziva 3
rodann 3
joins 77
soon 1198
faced 131
drinking 170
mummy 89
what's 773
going 4038
real 4571
snoozer 13
caught 551
later 2188
slow-moving 32
until 1771
66 16
ranges 29
george 837
n 189
neise 2
violence 1073
concentrates 34
dramatics 14
silly 883
triangle 64
rates 76
three 2192
diane 101
brewster 15
attack 445
they're 1243
fire 601
cure 98
insomnia 54
columbo 198
downhill 96
year 1876
reached 113
bottom 402
peter 753
falk 107
gives 1576
uninspired 123
crime 719
protocols 2
unheard 20
plausibility 29
lacking 274
brenda 84
vaccaro 11
chews 25
pulls 184
pantomime 10
faces 344
andrew 140
stephens 15
unconvincing 186
lady's 29
faint 39
hoot 53
patronising 11
brought 737
nineties 35
happy 915
memories 279
scripts 146
sharp 188
characterisations 12
garbage 455
leonard 99
maltin 20
aa 4
reliable 58
indicator 14
whoever 199
denied 34
access 92
medium 130
communication 46
ludicrous 175
motivations 95
guys 1296
totally 1305
absent 78
various 604
interactions 77
shallow 259
dad 448
preaches 9
violent 508
reaction 241
aggression 27
turns 1247
admirable 73
person 1523
ignore 177
philosophy 107
fists 24
message 822
able 1242
glean 6
pap 17
nuclear 125
alternate 87
living 1046
arrangements 24
happen 1040
cat 493
hat 199
sucks 279
track 385
sucked 250
appropriate 220
talked 125
cares 225
joined 89
writers 651
sound 1297
austin 79
powers 307
swinger 4
talk 825
overly 230
succeeded 106
it-it 2
belongs 142
100 447
unkiddy 1
carriers 15
follows 498
exploits 62
gals 23
stolen 190
mercedes 12
words 878
road 420
warrior 115
hood 153
hightailing 1
highway 62
beach 187
surfboards 3
strapped 25
brian 335
chris 416
pine 22
trek 245
driving 264
girlfriend 574
piper 29
perabo 8
coyote 21
ugly 344
shotgun 47
brian's 11
younger 501
brother 1009
lou 116
taylor 274
pucci 2
fanboys 9
friend--not 1
girlfriend--kate 1
emily 119
vancamp 1
ring 298
occupy 17
backseat 17
quartet 23
twentysomething 6
viral 3
pandemic--which 1
co-directors 2
co-scenarists 1
alex 216
pastor 25
david 985
absolutely 1485
about--has 1
devastated 30
america 638
naturally 265
exposition 76
shaves 8
fifteen 127
slowed 16
cynical 153
melodrama 188
humans 316
degenerate 20
crisis 149
become 1543
enemies 103
lethal 52
virus 135
shingles 1
bleed 47
die 720
everybody 377
runs 486
around 3584
white 1385
masks 76
nose 131
thin 325
rubber 79
initially 177
foursome 11
encounters 140
frank 451
christopher 410
meloni 10
runaway 44
bride 127
daughter 1039
jodie 56
kiernan 2
shipka 1
land 350
blocking 19
suv 20
swerves 2
waylay 2
process 301
oil 137
pan 79
ruptures 1
wind 265
foot 234
reluctantly 45
hitch 20
ride 408
seal 34
rear 54
wears 166
mask 214
speckled 2
heard 1106
doctors 67
curing 7
ailing 22
hospital 352
somebody 286
lied 23
physician 16
couple 1688
kool-aid 5
misery 90
improve 97
condition 142
kate 262
success 581
dial 26
phone 313
realizes 199
hope 1441
lets 330
heroic 110
indeed 720
qualifies 41
relentlessly 54
depressing 226
pandemic 1
sympathetic 224
homicidal 47
murderers 47
protect 165
reach 246
country 874
club 410
frolic 12
golf 37
course 2501
another 4315
suits 120
pump-action 1
shotguns 9
incredibly 625
protagonists 145
manage 271
escape 534
scare 216
almost 3121
falls 850
water 518
floating 89
eventually 719
discover 265
infected 73
run 1138
gas 188
blocks 20
outset 41
pair 238
older 654
christian 355
women 1721
pregnant 176
wife 1997
birth 188
needs 840
help 1890
throws 167
caution 38
blasts 16
ladies 291
automatic 43
pistol 36
refuse 64
catches 106
slug 31
leg 104
passenger 33
kills 527
beer 120
pizza 44
either 1858
virtually 213
non-existent 127
84-minute 1
heroes 302
turned 888
villains 278
care 1374
plight 90
impression 405
fun-loving 12
energetic 60
hang 136
hokum 19
well-known 86
relegated 22
inconsequential 27
tragic 344
mistake 424
showing 774
compassion 81
dying 312
pays 105
price 278
testament 82
pine's 1
change 951
point 3150
putting 355
himself 2154
pull 334
one-eighty 1
happy-go-lucky 16
heartless 36
directors 669
spanish 270
brothers 554
momentum 49
flag 44
since 2898
relief 237
sight 310
sinks 41
predictability 38
irréversible 3
cinematographer 94
benoît 4
debie 2
widescreen 70
lensing 2
unsavory 19
dynamic 111
aside 474
closure 41
suffers 201
horribly 214
german 494
shepherd 55
attacks 157
conjures 5
improved 115
fade-out 4
anybody 293
million 362
dollar 156
hotel 380
hinted 48
wenders 17
vision 295
compelling 383
stories 1167
map 83
moving 803
picture 1457
seals 13
coffin 51
afraid 343
unimaginative 60
sentimental 144
cliché'd 1
entirely 530
stereotyped 47
writing 1288
impatient 17
war-torn 10
delirium 8
uncle 319
patriotic 36
abstract 38
gazing 8
sky 310
conclusion 490
struck 121
simple 1005
filmmaker 310
magic 463
experimentation 19
perceptive 17
filming 392
possibilities 98
let's 666
finds 948
inspiration 169
toronto 67
festival 395
introduce 84
humility 18
offered 191
hours 974
dramas 134
hits 270
dire 122
appalling 125
lighting 358
purely 169
armature 4
letting 145
true 2282
adds 337
destroy 218
speeches 64
continuity 208
problems 883
seasons 235
door 405
shots 942
throughout 1358
finally 1535
professional 316
university 131
media 298
project 484
sorry 766
basing 14
television 884
popular 540
author's 33
works 1276
guarantee 91
yorkshire 10
learnt 23
bought 455
rights 180
books 500
credited 74
dick 287
francis 91
broadcast 112
under 1263
collective 55
racing 61
game 1247
gwilym 2
sid 81
halley 2
former 503
jockey 9
private 268
eye 738
accident 315
right 3246
artificial 94
suffered 150
acute 9
charisma 136
mick 48
irritating 230
chico 23
barnes 40
horse's 6
arse 10
whenever 270
six 344
weeks 201
less-than 1
duo 113
charged 75
countryside 102
foiling 3
nefarious 21
fix 94
races 59
methods 85
blackmail 37
kidnapping 57
riders 41
doping 2
horses 145
threw 112
avail 21
sexist 43
far-fetched 64
repetitious 15
carted 2
knackers 2
yard 79
episode 1641
program 246
q 113
dropped 129
points 809
children's 173
swearing 55
insults 61
tells 880
anyways 114
monkey 122
held 336
gun 521
retarded 156
acted 580
sarah 179
silvermann 1
use 1792
damn 354
lessons 153
biggest 514
blair 159
witch 302
nonetheless 164
appreciated 173
effort 788
altered 63
reading 676
superlatives 5
thrown 404
imdb 667
comments 777
unique 629
intelligent 528
future 887
gotta 128
wonder 1035
stuff 1165
describe 330
alas 162
weak 751
engage 93
respect 485
silliness 76
whatever 718
aspect 452
fellows 21
due 909
severe 97
delusions 19
profound 139
smart 382
bearable 36
experience 1055
worthwhile 186
starters 51
b-movies 58
feature 741
dialogs 142
amateurs 31
puzzles 18
improvements 15
small 1582
steps 144
worsen 3
oblivious 44
experiences 200
flaw 139
takes 2166
place 2380
location 332
confined 46
sánchez 2
failed 480
personality 329
whatsoever 319
considering 545
forest 189
antagonist 49
students 356
needed 676
thanks 468
sloppy 117
attention 893
details 408
salvageable 1
daniel 226
myrick 2
output 28
golden 256
shows 2301
structure 204
applied 48
foolishly 25
cover 508
ago 1029
clarke 69
duncan 28
lose 341
proceeded 22
pay 578
tax 53
took 1099
stood 133
aghast 12
abound 49
outstanding 417
promised 96
arrive 114
hung 91
shame 666
literally 465
cried 116
anymore 330
friend 1361
constantly 415
informed 53
ours 26
holiday 144
horrible 1198
began 319
yell 45
period 751
glimpsed 14
agreed 88
they've 256
offends 15
save 1019
list 544
astounding 59
humanity 267
alright 185
buff 95
kinds 191
test 233
won't 1197
mince 4
sissy 77
spacek 22
asked 295
rotten 94
trashy 97
suspected 56
cannot 1096
avoided 102
explaining 107
politely 17
subpaar 1
responsibility 88
stay 780
book 2340
chores 18
yourself 986
sandwich 16
amaze 22
excellent 2069
robert 938
de 700
niro 90
cape 57
stand 695
schtick 28
surprising 302
told 1048
wesley 44
snipes 48
typical 775
baseball 210
player 276
conceit 30
characterization 123
obsessed 213
less 1907
draw 196
pun 77
intended 387
sees 536
midnight 177
goodfellas 24
cop 559
check 758
taxi 87
driver 180
godfather 131
ii 360
drivel 123
goodness 102
jeffrey 105
jon 183
heder 12
29 25
mum 55
keaton 250
planning 123
anywhere 303
meets 664
businessman 81
named 785
mert 1
daniels 71
married 583
liking 108
hadn't 281
changed 481
selfish 109
brute 26
form 755
2007's 3
shocking 337
chemistry 486
saving 267
grace 319
anna 228
faris 18
smiles 66
barely 476
mood 425
recent 511
smother 10
difficult 694
adaptation 453
problem 1444
begins 796
alexander 116
mccall 5
smith 442
worked 629
deeply 320
condescending 34
spurious 5
africa 210
exist 293
botswana 2
borat 8
kazakhstan 2
successfully 160
realised 74
ceased 10
gall 13
jill 59
scott 530
singer 263
mma 6
ramotswe 3
represent 103
woman 2617
african 179
makutsi 3
anika 4
noni 12
rose 221
young 3621
roles 1110
glamorous 66
brutally 90
murder 1046
local 875
accents 202
focus 498
brutality 80
scott's 51
bouncy 14
soft 209
rose's 19
motor-mouthed 1
bitch 65
result 630
unwatchable 107
principal 101
redeemed 31
presence 410
lucian 5
msamati 2
mr 1444
jlb 2
matekoni 2
hes 32
smarter 34
intense 341
unable 247
shining 128
light 867
ocean 88
suckage 1
contradictions 22
clearly 899
laid 138
feet 234
whichever 20
committee 24
butchers 8
smith's 40
yet 2728
notoriously 15
refuses 154
contain 156
experiments 89
grammar 21
border 119
scientific 112
name 1555
mid-sentence 3
achievement 123
team 780
largely 224
anglicised 1
speak 514
opening 961
sensitivity 41
flirt 22
openly 43
moans 13
computer 448
restyled 1
makeup 203
jewellery 2
surprised 801
macbook 1
handbag 5
along 1765
visa 9
card 142
upset 154
crappy 241
honestly 454
apocryphal 3
paints 50
fictional 186
populated 53
non-threatening 6
palatable 23
wisdom-nuggets 1
reads 93
linguistic 3
travesty 81
certain 765
wishes 154
european 273
audiences 476
notice 366
promptly 60
whose 984
wants 1288
loot 18
discovers 240
bucks 124
foiled 6
lucky 238
keep 1599
falling 380
man's 329
hands 624
familiar 526
boggles 21
mind 1834
claims 204
slasher 475
nurse 119
charlie 388
camera 1615
extremely 1066
obscure 118
on-screen 95
deaths 203
pruning 3
rip 166
neck 133
graphic 237
mean 1646
taken 984
seriously 995
cycle 50
reflection 80
traditional 255
elements 779
tongue 98
cheek 57
town's 34
welcome 214
marks 119
population 110
slightly 538
possibility 107
killers 241
audience 2135
relax 77
darn 69
forget 714
advise 90
clear 772
bore 176
fighting 584
choreographed 88
convincing 534
hong 188
kong 254
legends 68
bey 18
logan 58
audio 110
commentary 318
ninja 79
wish 949
overall 1435
rule 180
contains 411
emotions 388
toyed 4
british 887
mysteries 105
logically 20
disappointed 915
logical 122
inconsistencies 40
utilize 17
cctv 8
cameras 109
early 1579
gather 78
mystery 829
huge 943
truck 169
stopped 230
blocked 14
disappearance 42
critical 170
inconsistent 72
children 1329
lengths 25
sophistication 38
equipment 84
tracking 74
movements 112
misses 117
opportunity 393
vehicles 61
entered 63
camera-visible 1
adjacent 9
developing 100
england 289
meters 12
flower 50
kiosk 2
parked 22
immediately 462
side 1200
forensics 10
meticulous 16
discarded 25
cell 168
sewer 22
drain 36
miles 257
evidence 220
injury 48
secured 9
intervening 11
rainfall 5
search 298
dogs 196
known 961
hound 21
dog 648
hunting 138
illogical 99
publicized 7
news 326
presumably 127
innocent 410
extremes 32
expend 9
carpet 41
fiber 10
fingernails 19
eventual 59
investigators 12
even 1
coaxing 5
crawled 12
unguarded 4
mobile 58
ask 641
fibers 2
nails 64
call 911
crowded 39
residential 2
suspect 301
abducted 30
portrayed 596
mentally 153
dimwitted 14
justifying 15
unknowingly 18
drowning 44
mother 1
cooperate 14
fully 413
self-incriminate 1
sleuth 34
aficionado's 1
five 851
science 509
theater 817
3000 81
thankfully 180
crow 33
servo 10
watchable 301
follow 722
firmly 64
confirmed 38
summarized 19
featured 191
mst3k 137
preceded 24
mitchell 119
greatly 154
margaret 108
atwood's 3
novel 937
robber 26
thrilled 66
version 2139
frames 59
boyfriend 362
buddy 237
ex-cop 11
journalist 110
checking 138
woman's 142
crazy 637
female 927
fortunate 47
fixes 8
ms 349
clumsy 105
plotting 56
focusing 106
men 1815
victims 375
scheming 45
heh 15
mentioned 549
eat 272
dust 85
hardback 2
copy 571
carry 322
zenia's 5
manipulations 6
unless 670
roz 11
charis 10
toni 60
important 907
hurts 98
pushed 127
normally 304
feminist 69
angles 203
luck 250
luscious 27
prose 14
subtly 63
layered 33
excavated 1
ironed 3
sprinkled 27
angst 64
revenge 540
atwood 2
horrorfest 14
past 1260
weekend 205
gravedancers 3
limited 301
fizzled 5
sympathize 72
each 2578
erratic 29
mis-casting 1
12-year-old 11
sheriff 226
sat 288
background 615
helped 324
seem 2173
amateur 204
initial 209
potential 612
skip 296
central 410
confusion 161
relationships 360
setting 618
social 552
context 257
harvey 98
keitel 35
element 390
lacks 365
impeccable 35
clarity 44
intensity 157
character's 310
che 160
directly 193
narrator 112
remain 209
unclear 48
defined 78
divided 46
generation 223
cliché 325
discuss 105
depicts 90
impact 373
revolution 185
boy's 64
political 592
stance 50
murky 50
responsible 275
bloodshed 37
property 84
acquired 54
gambling 72
profits 29
refusing 27
making 2603
cuban 53
cowardly 39
english 944
cubans 11
speaking 377
permission 24
cuba 104
figure 743
unbelievable 432
visual 522
distracting 107
references 250
greek 111
chorus 98
gratuitous 236
intellectually 37
ostentatious 3
consistently 102
waiting 545
hasn't 371
syrupy 13
nostalgia 88
feedback 10
loop 34
ensemble 146
gags 260
human 1535
event 362
binds 6
chill 56
seminal 23
spawned 30
copycat 9
wanting 297
particular 729
superficiality 13
creates 242
maddening 12
below-average 9
hanna-barbera 5
famous 760
watered 23
formulaic 96
animation 819
obnoxious 162
repetitive 122
h-b 1
situations 486
regardless 125
thus 416
popeye 17
bluto 2
appear 616
recurring 35
segment 254
cavemen 28
hey 400
flinstones 2
em 121
apparent 308
ripoff 45
benjamin 45
olive 28
oyl 5
goon 16
regular 265
features 641
army 441
recruits 30
adding 166
annoyance 41
factor 208
public 544
service 201
announcements 7
standard 428
practice 101
lectures 17
nephews 15
crossing 58
street 671
safely 48
recycling 11
dangers 36
smoking 115
swear 111
charm 406
remaining 120
mercer 8
voice 1027
continues 261
appreciation 88
fleischer 16
shorts 148
valentine 62
prevent 123
teenage 322
sub-genre 34
decade 248
i've 3342
complaining 76
rips 49
halloween 239
prom 114
carrie 100
hate 774
redundant 56
blatant 103
bowl 64
jeremy's 3
carrie-rip-off 1
structured 38
goofy 156
teen 276
thriller 858
briefly 135
killed 1108
oh-but-that-stuff-only-happens-to-other-people 1
suspenseful 191
hopelessly 74
arrogant 99
divides 9
date 417
according 296
brief 393
history 1312
lesson 254
jeremy 135
treated 273
assumed 82
significance 80
importantly 127
initials 3
terrorized 22
sixth 52
grade 364
signed 88
vicious 115
valentine's 17
cards 96
uncommon 19
deliberately 108
misled 13
behavior 258
prime 190
suspects 156
perfect 1563
links 29
middle 796
party 531
flirtatiously 1
hateful 54
walks 213
disappearing 34
explanation 290
already 1372
cardboard 129
altogether 111
killer's 50
identity 250
predict 69
subtle 427
rip-off 120
shelley 89
stabs 39
scalpel 11
suggesting 53
staying 109
silent 431
revealing 121
herself 809
stolid 9
relentless 62
unstoppable 26
emotionless 26
gigantic 48
butcher 57
knife 143
jamie 125
blanks 28
trouble 518
mentions 84
influenced 102
plagiarizes 1
meyer's 7
michael's 35
effective 509
nosebleeds 3
shameless 45
mislead 17
drawn 381
and-the-killer-is 1
removal 15
adam's 21
holds 296
reluctant 71
unexplained 70
cleverest 6
identify 130
empty 269
wasn't 2307
scared 304
impressed 352
theatrical 224
previews 71
theater's 5
battlefield 43
earth 862
maven's 1
overrated 114
overpraised 3
overdone 119
melange 10
1951 48
merits 80
dwarfed 5
competition 127
sun 166
streetcar 19
desire 304
abbott 28
costello 27
invisible 195
51 20
arthouse 14
crapola 3
closing 176
ballet 92
claptrap 18
intellectual 165
crowd 215
capable 226
charismatic 134
kelly 372
caron 52
12 288
201 1
oscar 742
winners 39
hobgoblins 45
concept 513
rick 100
sloan 8
master 426
brilliance 128
produce 226
chose 202
sort 1457
acid 83
gone 748
serriously 1
warehouse 43
suction 1
cups 10
vaccum 1
cleaners 6
pain 375
caused 237
equal 140
genitals 24
carved 12
spoon 21
wound 90
covered 200
salt 64
hydrochloric 2
horrendously 20
manages 583
racist 174
pretending 93
terribly 272
chic 17
atrocious 194
steer 52
offensive 209
schaech 13
scrubs 17
kissed 20
gross 151
eastwood 99
schaech's 1
leaves 682
room 903
exclaims 12
king 900
foreigners 18
cultured 15
artist 300
paris 398
jonathon 10
likeable 50
astonishingly 36
good-looking 57
learn 719
cutting 184
edge 412
gregg 7
araki 1
salvage 44
descending 15
string 113
mire 7
homophobia 12
awesome 484
box 576
wired 9
camra 2
unknown 283
killings 131
wcw 15
s 1140
vanessa 64
sanchez 15
tygres 1
folded 6
low 1278
especialy 3
errors 108
fun 2647
severed 58
unfourtunatly 1
isn 9
t 644
voodoo 43
heads 280
blockbuster 182
build 296
basic 520
storyline 802
maria 165
schrader 13
searching 142
families 238
rhythm 70
ruth 112
rescued 56
nazis 107
katja 8
riemann 11
dimensional 91
stereotypical 172
cuts 262
forth 185
present 586
york 783
40s 70
indication 72
 1337
jabber 2
jews 72
tormented 59
bureaucratic 9
break 582
rosenstrasse 39
freed 39
answered 58
goebels 2
lean 53
fischer 16
venice 22
award 390
k 181
jewish 160
liongate 1
prove 265
lionsgate 5
opportunities 85
slapping 27
cabin 173
fever 112
frustrating 79
here's 265
random 357
transfers 11
camp 450
dies 386
talking 925
bitchy 38
classmate 11
enjoyable 840
paying 181
screaming 270
bulls 11
confused 374
motion 372
karate 57
hickish 2
hicks 25
sit 690
chair 150
their's 7
plan 418
wow 425
hour 1075
plant 91
tree 157
productive 21
pick 423
nasty 339
producers 489
ana 23
cristina 29
oliveira 1
honest 474
balances 13
permanently 26
over-acting 31
preposterous 75
under-acting 1
passes 106
odete 2
childlike 28
impostor 11
knows 898
kinda 274
sorta 32
dictating 9
rules 230
portuguese 43
suffer 178
soundtrack 760
permanent 42
dubbing 151
mass 148
noise 135
countries 150
portugal 21
noisiest 1
places 409
dialog 766
dubbed 211
necessarily 180
solve 139
syndrome 53
strange 922
strikes 135
technical 305
classical 87
leaving 479
suspended 34
expositive 1
raw 173
unpleasant 110
total 631
stress 97
prefer 175
concentrate 58
un-innovative 1
rui 1
poças 1
believing 135
non-actors 22
rolls 45
mountain 189
gorgeous 369
lover 360
survives 62
loss 268
apathy 13
seductive 53
lovers 279
boys 610
obsessions 13
they's 1
c'est 5
la 518
vie 6
tony 469
enemy 195
state 503
appalled 37
richard 831
donnie 14
darko 8
genius 447
mickey 108
rourke's 5
cant 200
rourke 41
accidence's 1
keira 26
knightly 24
thats 345
j 357
seaton 5
crap 1007
fest 79
randolph 62
closet 101
lived 352
cary 103
grant 243
57 11
gail 24
russell 188
31 24
chronic 15
alcoholism 37
chain 107
marvin 39
villainous 46
westerns 162
glamorise 2
guns 280
0 220
immature 67
naked 427
pants 88
creative 357
heck 218
freaking 51
whats 85
nick 283
hightlight 1
growing 293
parents 756
brother's 67
uncreative 10
aired 142
onto 328
kari 24
complaints 76
catching 81
definition 81
substandard 14
commenting 64
sex 1600
softcore 24
porn 345
pasty 5
dude 175
wuhrer's 2
tease 29
cinemax 20
should've 73
capitalized 5
lone 86
hot 642
7 866
0f 1
offcourse 2
within 821
captivate 14
during 2130
leading 613
spark 75
merely 359
0000000000001 1
thirty 116
grass 58
grow 223
wards 16
nadia 24
kazaam 22
glitter 17
combined 198
personal 626
bogdonavitch 1
detectives 66
models 102
millionaire 67
playboy 57
touch 465
bored 525
jealous 119
curio 14
dorothy 138
stratten 22
murdered 259
patti 12
hanson 25
marry 225
keith 84
richards 90
model 226
ample 48
stratten's 3
added 438
convoluted 121
relate 235
manhattan 119
beckon 4
snore 16
entertain 172
inside 598
doubt 751
erm 18
scariest 62
nope 65
effect 627
hiding 142
covers 135
knew 898
sister 759
misty 44
shower 156
toppan 2
1974 60
listen 330
flutes 3
violins 7
remarks 91
reference 160
indulgent 29
admission 44
approached 55
cynicism 37
viewed 205
predecessor 63
adoptee 1
preparing 63
birthmother 2
relating 49
protagonist 219
asks 329
adoptees 1
who's 711
mama 52
mom 329
troupe 26
listless 22
sap 27
comforted 9
annoyances 7
botched 31
directing 640
strike 125
songs 904
lyrics 104
translation 114
choreography 115
crab 10
cooking 52
arty 51
blablabla 2
silence 129
hearing 229
moaning 19
boredom 141
deep 621
porn-like 1
carpenter's 43
outing 71
masters 106
opposite 264
proved 249
cigarette 52
burns 181
pro-life 14
perhaps 1673
devoid 104
atmosphere 732
overstays 2
less-than-an-hour 1
running 967
irritable 7
un-appealing 1
beyond 860
absurd 303
suckers 11
carpenter 118
describes 101
proud 185
notices 42
screw 61
says 1108
essential 158
rectify 9
sincerely 64
creature 324
technically 192
notch 130
schemes 32
shonda 2
rhimes 2
outsourced 4
somewhere 483
offshore 2
mediocreland 1
pp 2
promising 205
flicks 351
picket 5
fences 11
ally 60
mcbeal 8
boston 68
legal 85
cases 162
outlandish 47
evoke 42
sympathy 199
sadness 112
medical 149
tick 23
dramatic 644
sentiment 78
therapist 29
amy 102
brennan 37
incompetent 86
unethical 7
untrained 5
writes 86
flunked 2
ethics 30
transference 9
counter-transference 2
courses 11
stanford 8
code 182
nose-bleeding 1
therapist's 1
involvement 112
therapists 2
yearning 35
moved 322
we've 263
graduated 24
city 1129
addison 9
youthful 61
towards 636
likes 464
age-inappropriate 1
unnatural 46
talented 572
developments 38
struggling 195
decision 237
move 725
dr 697
coping 28
widowhood 2
walmart 17
store 496
rises 78
level 916
earmarks 6
drive-in 67
theaters 228
market--ultra-low 1
liberal 118
dose 75
buck 153
strippers 17
extras 227
wacko 13
doctor 569
transplant 39
girlfriend's 19
unsuspecting 61
donor 7
donors 6
skanky 4
model--whose 1
titillate 8
remove 66
clothes 324
naughty 74
merit 109
buffs 95
stilted 92
hammy 71
plummer 37
nastassia 2
kinski 43
b 871
rubbish 273
established 157
decades 171
masterpieces 83
tess 44
bad-guy 13
sneers 9
bystanders 9
overdo 8
panicking 5
throwing 167
buried 125
hilt-deep 1
shoulder 65
seconds 347
arm 141
difficulty 70
marines 39
machine-gun 6
referred 74
50 331
sorts 190
tying 21
bandage 3
thereafter 39
limp 36
fist-fights 3
sustains 10
multiple 188
punches 64
cranium-first 1
frame 216
backwards 67
third 702
paving 4
slightest 122
ankle 18
trifling 5
inconvenience 4
dull 806
class 751
undoubtedly 107
callous 21
villain 577
resorting 27
ham 59
techniques 135
ve 21
haff 3
vays 2
meance 1
menace 100
aware 261
70's 328
007 19
bruce 375
lee's 89
faked 26
near 759
roger 201
moore 192
ignored 120
posted 71
site 235
figuring 29
wardrobe 62
consisted 34
cameo 250
outfits 74
painters 22
depot 4
tin 26
foil 48
ittenbach's 2
burning 134
moon 279
humorous 261
premutos 4
sequences 721
pi 22
schnaas's 1
jorg 3
buttergeit 1
olaf 3
ittenbach 5
subject 695
schramm 4
nekromantiks 2
occasion 106
primarily 104
crewed 2
ship 314
wwii 144
primary 105
racial 93
underlying 82
hammered 19
excessiveness 4
commend 21
served 158
uss 4
mason 59
triumph 115
adversity 24
hardships 31
endured 32
accomplishments 10
navy 157
racism 149
tomb 49
wicked 118
medieval 52
magician 57
naschy 53
abanazer 2
church 384
hall 202
panto 1
descendant 18
ancestral 5
reunites 15
magician's 3
separated 58
witchfinders 1
executed 229
er 51
rising 89
hell 988
breaks 259
magicians 6
lovely 420
assistant 143
one's 249
helga 20
practically 233
periodically 19
kit 21
nudity 590
naschy's 14
paunchy 1
film's 1034
angle 180
laughably 81
plans 204
suddenly 535
decide 482
grope 4
nubile 19
blonde 258
possessed 104
notably 119
herschell 4
gordon 218
lewis-esquire 1
plunges 17
chest 90
heart 1175
zombies 514
coming 1022
ludicrously 28
inept 174
haven't 799
clue 223
happening 383
figures 189
shambling 9
distance 115
labourer 4
hypnotic 38
spell 124
close 1124
serves 203
chopped 57
pieces 389
masterpiece 605
2008 79
mired 8
remake 578
culture 460
studios 180
determined 160
ruin 203
thoroughly 350
updates 10
wicker 31
starred 168
lazy 167
mentality 69
phenomenon 69
dough 19
do-do 3
proves 358
colorized 8
bob 253
clampett's 8
surreal 205
porky 12
wackyland 1
splashing 7
colour 136
footage 649
overseen 4
friz 4
freleng 3
unsuitable 12
tampering 9
source 204
material 754
truth 694
inspired 328
insanity 64
inevitably 82
raping 30
attached 132
equivalent 86
colorization 2
casablanca 51
minimal 118
development 639
went 1463
let-down 20
rebels 46
military 435
puzzled 37
mini-plots 3
dumbfounded 11
aspects 398
so-called 163
prophecy 47
explained 282
mini-series 78
sci-fi 565
channel 423
made-for-tv 91
excuse 418
extreme 348
inventive 96
skyscraper 5
kite 10
epidemic 25
nightmares 107
roaming 27
spirits 105
alcatraz 12
mix 355
elm 84
vampire 398
fare 208
jammed 12
exhaustively 3
dig 142
mullets 7
fooled 94
1987 82
winner 217
scroll 12
academy 293
sicence 1
fiction 427
fanatasy 1
devo 3
contributes 38
basil 33
disaster 317
liner 23
gangster 243
weakest 99
entry 141
petty 83
criminal 323
amount 493
fine 1316
styling 10
substance 216
kevin 285
spacey 78
gonna 241
general 753
effectively 187
wasnt 16
voices 216
actions 310
performed 190
hilarity 66
slaughtered 37
balcony 31
glass 151
attempted 136
escapes 163
mayor 86
outside 598
upstairs 47
hero 936
idiot 183
flail 2
ineffective 25
hacked 20
insert 46
occurs 131
walk 498
cry 395
pappa 1
seemingly 346
obvlious 1
corpses 73
spooky 123
strangers 80
flesh 208
skin 200
flee 32
fool 207
open 615
downstairs 17
dont 74
neighbourhood 12
standing 238
needless 162
drinks 59
blindly 20
drunk 280
giggle 35
stupidity 158
escaped 109
wrath 36
gymkata 16
paper-thin 16
deal 715
centers 91
gymnast 19
chosen 226
government 402
agents 93
quasi-government 1
agent 356
competing 31
eloquently 10
blandly 12
kurt 144
thomas 239
trains 54
compete 62
bare 99
bones 57
sypnopsis 1
joys 26
movie's 423
gymnast's 1
asian 222
sudden 247
shut 162
shirtless 9
pleases 13
hero's 56
romp 80
village 248
crazies 13
evidently 71
place's 2
visit 260
shines 149
wise 243
stick 444
gymnastic 6
alleys 12
squares 14
eastern 77
cities 88
skills 267
scourge 6
parallel 88
bars 65
pummel 6
believed 206
i'd 1344
arrow 47
arrows 24
believable 708
compliment 51
devised 19
realistic 737
wounds 59
nevertheless 236
deserves 591
target 206
riffing 7
installments 20
beat 337
krueger 44
alice 183
prettier 15
blond 94
dan 245
daytime 46
soap 261
newer 64
harsh 199
sweet 544
chip 41
gruesome 162
one-liners 141
leslie 172
bohem's 1
ground 332
hopkins 75
grandmother 117
unrealistic 226
versions 252
leaden 20
bland 272
alistair 8
sim 12
infinitely 44
scrooge 86
meanest 8
conviction 74
undergoes 15
metamorphosis 21
similarly 95
muppets 71
define 54
replace 78
woodstock 16
civil 137
apollo 38
moon-landing 2
titanic 184
sinking 60
you've 706
opera 361
low-life 16
allowed 325
composition 49
meanies 1
nuttin 2
topic 158
yeah 460
insight 187
underclass 5
slut 41
bar 369
lane 158
abuse 190
raise 164
moonlanding 1
ipso 1
facto 4
portrays 229
1969 68
force 481
constructive 21
elaborate 117
wake 132
bites 40
throat 119
slashes 12
dallas 45
gut 44
cause 530
immediate 80
count 334
clichés 290
meeting 237
protagonist's 17
convinced 214
bets 30
teacher 304
donna 100
spends 188
maximum 47
security 192
prison 484
breaking 192
celebrating 32
accounting 9
stalk 29
schools 66
allow 308
proms 1
hotels 15
perfectly 631
suppose 397
randomly 85
biting 47
trade-off 3
excitement 221
utter 240
chewed 9
bubble 47
gum 21
seat 210
wallet 27
self 415
milk 77
bread 68
dear 146
screenwriter 153
1980 98
citizen 122
kane 132
curtis 136
post-halloween 2
she'd 58
dancing 511
fights 276
boyfriends 32
attend 83
colleges 13
cheat 36
entrance 48
exam 13
bag 143
cleaning 57
supplies 32
wipes 22
stab 41
trace 54
struggle 323
official 105
rooting 63
triggered 8
sirens 15
ordering 20
exit 59
building 382
constant 291
insisted 31
reenacting 4
tee 14
brittany 19
snow's 4
win 481
pot 84
understatement 46
week 425
tornado 23
gust 1
power 918
outage 3
slight 135
tomatoes 88
favoring 4
smelling 7
influence 210
beers 45
alcohol 80
amazed 183
universe 195
veronica 31
mars 92
chewing 33
enthusiasm 85
drive 359
earnest 55
relevant 131
cut-off 2
reality 965
rob 248
staff 108
snooze-fest 3
kristen 19
over-the-top 201
dentist 144
dolls 96
feinstone 42
corbin 38
bernsen 42
cheating 102
poolguy 1
snaps 27
drill 27
delivered 241
ruffalo 7
eternal 72
sunshine 116
yuck 24
jet 112
li 88
martial 319
jackie 214
chan 153
jet's 4
par 154
flashdance 13
jennifer 247
beals 13
g 341
jane 600
demi 21
sweats 7
ridley 22
80's 426
blooded 23
lady 811
scarred 27
murderer 176
abandoned 186
stock 250
reels 27
warned 173
labelled 9
cursed 41
warnings 30
ahead 391
reprise 22
murders 364
occurring 31
butchered 39
excuses 54
stage 682
vengeance 94
unsuccessful 31
unoriginal 83
derivative 60
pattern 58
independent 310
australian 205
textbook 29
shonky 4
shamelessly 35
knocks 55
delight 157
gawd 14
forgettable 203
ala 43
originally 290
helping 173
slice 68
cheesecake 9
strongest 70
throwback 26
slashers 46
scream's 1
offspring 30
b-grade 31
treatment 233
surprises 204
pure 560
mockery 36
molly 87
ringwald 22
crown 56
wash-up 3
returning 124
send-up 19
provides 350
bite 110
recognizable 68
ravishing 37
jessica 168
napier 14
curry 16
roberts 142
pop 277
kylie 11
minogue 7
appearance 447
teens 188
formula 249
horny 55
dim-witted 19
queue 14
interestingly 69
phase 53
red 754
herrings 35
u-turn 7
satire 260
choppy 76
madness 160
sports 216
referential 2
tongue-in-cheek 52
approach 371
over-stated 1
poking 29
looses 25
humour 439
bleakness 7
isolated 98
grand 293
mansion 156
neat 142
touches 206
spookiness 4
nicely 295
low-budget 273
systematic 8
spoke 89
hurt 369
smart-ass 3
attitude 237
notes 123
ranged 9
cut-away 2
out-of-place 19
kimble 7
rendall's 2
careless 28
contributing 19
factors 61
sheer 247
badness 42
imagination 351
matches 101
lousy 214
schlock 69
tower 61
netflix 60
mailings 1
quiet 282
pulled 274
realized 309
borrowed 84
jacket 57
all-star 29
paxton 69
william 585
spoiler 407
warning 311
lo 39
behold 71
kimberly 14
williams 337
meg 67
tilly 24
jerk 121
womanizer 16
matt 222
craven 84
goldblum 56
etc 1207
insufficient 13
unca 1
perkins 28
err 21
flopped 15
morning 264
missed 562
endearing 139
sleeping 176
replied 20
assignment 51
trent 25
harris 248
teaches 76
occasionally 255
dept 10
u 452
documentary 914
section 196
yes 1529
nut-job 4
sean 253
penn 58
onj 1
highlight 200
loses 261
crispin 29
glover 122
larry 175
story-telling 31
remembered 249
live-action 55
showroom 5
spun 21
crashed 41
remembers 54
walked 194
turkey 171
associated 131
hired 185
chicks 85
depended 12
animal 322
slaughter 85
videos 136
shock 360
watcher 43
strangulation 7
stuffs 7
worms 57
puts 380
hamburgers 5
strangles 6
btk 33
broiler 1
burger 11
king's 90
ha 158
relied 34
actual 793
facts 223
bunch 811
rodents 6
scorpions 2
cow 47
sierra 24
bogart 50
palance 72
whom 644
subtility 1
hig 1
producer 404
winters 105
asking 228
compare 325
ida 23
lupino 23
surely 415
color 393
pseudo-film 1
noir 361
learning 173
accidentally 200
flung 11
psychotic 116
robot 209
freaked 37
radio 275
worlds 143
recently 577
realizing 97
joaquin 9
phoenix 47
leaf 17
harder 111
andy 295
knocked 74
unconscious 35
oxygen 18
tank 76
float 29
doors 125
max's 4
shouts 32
whaaaaatttt'ssss 1
happpeniiiinngggg 1
rogers 164
25th 9
spoons 10
ignorant 96
appreciate 507
stargate 83
sg-1 46
hackneyed 75
technobabble 5
insipid 71
voyager 43
pleasure 304
anchored 9
solid 499
spader 15
fascinating 389
egyptian 45
architecture 35
score 1025
anderson 192
macgyver 10
asleep 213
episodes 938
sets 850
somebody's 13
basement 133
vanilla 56
amazes 22
farscape 8
reimagined 1
battlestar 47
galactica 48
smaller 105
rabid 31
fanbases 1
sly 48
stallone 67
awards 245
mullet 17
haired 32
muppet 69
calls 260
italian 495
wise-guy 2
refugee 26
stinks 96
overacting 85
steals 211
dishonours 1
compensate 43
talent 913
shouting 68
arms 171
gesticulating 3
wildly 76
fashion 335
meteor 50
lands 76
sex-crazed 6
nymphets 1
certificate 14
strip 124
underwear 57
heat 124
losing 218
finished 297
reasonable 117
order 945
leads 747
strips 26
knickers 8
panties 25
suspenders 2
garter 2
belt 60
toilet 128
fuss 38
trivial 46
ruining 48
inform 40
goat 41
arrived 93
husband 913
estranged 58
woods 400
interests 82
enacting 3
pagan 14
rituals 21
sticks 117
turning 333
hanging 215
pagans 2
exploitative 43
bared 5
kinky 32
couplings 4
aforementioned 126
goat-sex 1
exploitation 222
surprise 710
disney 650
recycle 8
oblivion 36
cheaper 33
drop 185
despicable 69
display 205
crossovers 3
signs 106
disregard 42
remotely 189
iago 20
disney's 90
specialty 20
stunk 30
caliber 71
studio 480
surpasses 33
ktma 2
super 332
superdome 8
orleans 81
football 216
hated 296
gallactica 4
tight 159
uniform 59
caprica 45
outdoor 29
feeling 1138
sitting 447
gyrating 5
token 64
towels 4
polly 58
walker 103
awfully 84
walker's 10
hotties 4
esai 11
25 188
bsg 60
skeptical 47
sharpen 4
pencils 2
scifi 60
oc 9
planet 474
steve 465
mcqueen 52
loyal 98
fellow 363
brownie 4
st 138
louis 213
mcqueen's 10
record 280
heist 74
gang 394
broad 111
hint 148
relationship 959
members 544
mainly 391
resume 48
mccarthy 46
afoot 8
crahan 1
denton 4
dukas 2
rough 173
suspicions 26
aroused 24
robbery 91
charles 405
guggenheim 2
stix 6
documentaries 120
jokers 7
steve's 14
marlon 67
brando 130
imitation 84
willing 319
powell 189
productions 175
alive 462
overlooked 127
dressing 67
serbs 22
serbian 42
origin 61
criteria 25
neutrality 6
instance 289
diaspora 3
croats 5
ustase 1
yugoslavia 24
organizations 13
cetniks 2
balkan 10
ww2 49
paratroops 1
fascist 45
monarch 21
collaborated 11
germans 91
hitler 237
cetnik 1
leader 244
mihajlovic 1
thousands 153
hundreds 149
villages 15
bosnia 12
croatia 11
ante 6
pavelic 1
hm 6
suspicious 87
interviewed 45
studied 47
homework 28
presented 412
kosovo 6
ages 248
belong 85
serbia 15
dominated 52
krajina 3
largest 35
knin 1
importance 130
croatian 8
celebrated 55
zvonimir 2
crowned 5
value 515
800 5
fair 449
double 310
standards 354
morality 120
constitution 17
laws 77
lie 165
implemented 9
radical 61
paramilitarian 1
glavas 1
muslim 84
oric 1
accused 122
negative 351
radicals 9
paramilitary 1
leaders 63
seselj 1
arkan 1
overview 15
prepared 168
guts 140
criticize 51
relatives 89
significant 182
participants 49
milosevic 5
jovic 1
bulatovic 1
tudman 1
izetbegovic 3
karadzic 2
frustrated 124
support 393
connections 68
bin 106
laden 32
conflict 270
nationalist 13
presidents 11
bosnian 11
muslims 49
ethnic 68
previosly 1
rely 75
nationality 12
spirit 526
connecting 33
common 502
religion 234
mujahedin 1
th 22
europe 214
nationalism 6
unite 14
shown 993
edison 42
justin 85
timberlake 62
uttered 26
fate 270
r 337
squad 74
